package org.example;

// 12.09.2022 Создать новый maven-проект и репозиторий maxima-java-02

//12.09.2022  В pom.xml установить версию junit 4.13

// TODO: 12.09.2022  Описать класс City (город) со свойствами:
//        name — имя, строка.
//        distanceKm — расстояние, число

// TODO: 12.09.2022  Описать класс Transport (транспортное средство) со свойствами:
//        name — имя, строка.
//        capacity — грузоподъемность, число.
//        speed — скорость, число.
//        costOfKm — стоимость за километр, дробное число

//TODO: 12.09.2022  Описать метод float getPrice(City city), возвращающий стоимость перевозки для нашего транспорта.

//TODO: 12.09.2022  В обоих классах описать конструкторы с указанными свойствами в указанном порядке и геттеры-сеттеры всех свойств.


public class App 
{
    public static void main( String[] args )
    {
        System.out.println( "Hello World!" );
    }
}
